---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevisionIssuedBy
source: html/2afd7108-847b-c945-af6e-80103b99c85a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevisionIssuedBy Property

"Current Revision Issued By"

## Syntax (C#)
```csharp
public static ForgeTypeId SheetCurrentRevisionIssuedBy { get; }
```